<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
<key>PayloadContent</key>
<array>
<dict>
<key>DNSSettings</key>
<dict>
<key>DNSProtocol</key>
<string>TLS</string>
<key>ServerAddresses</key>
<array>
<string>2606:1a40::4</string>
<string>2606:1a40:1::4</string>
<string>76.76.2.4</string>
<string>76.76.10.4</string>
</array>
<key>ServerName</key>
<string>family.freedns.controld.com</string>
</dict>
<key>OnDemandRules</key>
<array>
<dict>
<key>Action</key>
<string>Connect</string>
<key>InterfaceTypeMatch</key>
<string>WiFi</string>
</dict>
<dict>
<key>Action</key>
<string>Connect</string>
<key>InterfaceTypeMatch</key>
<string>Cellular</string>
</dict>
<dict>
<key>Action</key>
<string>Disconnect</string>
</dict>
</array>
<key>PayloadDescription</key>
<string>Configures device to use ControlD Family Friendly Encrypted DNS over TLS</string>
<key>PayloadDisplayName</key>
<string>ControlD Family Friendly DNS over TLS</string>
<key>PayloadIdentifier</key>
<string>com.apple.dnsSettings.managed.39ea51df-0267-482a-bcb8-b6df5767e8c7</string>
<key>PayloadType</key>
<string>com.apple.dnsSettings.managed</string>
<key>PayloadUUID</key>
<string>a84ab6d9-a194-4a01-8eb0-453e6e1cd160</string>
<key>PayloadVersion</key>
<integer>1</integer>
<key>ProhibitDisablement</key>
<false/>
</dict>
</array>
<key>PayloadDescription</key>
<string>Adds different encrypted DNS configurations to Big Sur and iOS 14 based systems</string>
<key>PayloadDisplayName</key>
<string>ControlD Family (DoT)</string>
<key>PayloadIdentifier</key>
<string>com.notjakob.apple-dns.492e02d1-9078-450c-b009-bc085d638353</string>
<key>PayloadRemovalDisallowed</key>
<false/>
<key>PayloadType</key>
<string>Configuration</string>
<key>PayloadUUID</key>
<string>a8d00d34-73bf-4396-bf4b-f3aa6819c31c</string>
<key>PayloadVersion</key>
<integer>1</integer>
</dict>
</plist>
